app/views/films/show.html.erb

SELECT "comments".* FROM "comments"
---

  <% Comment.all.each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <div class="mar-btm mt">
                  <p class="text-semibold media-heading box-inline"><%= User.find_by(id: comment.user_id)&.nickname %></p>