app/controllers/comments_controller.rb

INSERT INTO "comments" ("film_id", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["film_id", nil], ["user_id", nil], ["comment", "asd"], ["created_at", "2024-02-22 18:24:11.281307"], ["updated_at", "2024-02-22 18:24:11.281307"]]
---
    def create
        debugger
        item = Comment.create(
            comment: params[:comment][:comment],
            film_id: session[:film_id],
            user_id: session[:user_id]
        )