app/controllers/comment_controller.rb

INSERT INTO "comments" ("film_id", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["film_id", 1], ["user_id", nil], ["comment", "jjj"], ["created_at", "2024-02-22 11:58:59.158362"], ["updated_at", "2024-02-22 11:58:59.158362"]]
---
    def create
        item = Comment.create(
            comment: params[:comment][:comment],
            film_id: @current_film,
            user_id: @current_user
        )