app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "nickname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "1111"], ["nickname", "1111"], ["email", "iva1n@mail.ru"], ["created_at", "2024-02-21 15:45:51.253702"], ["updated_at", "2024-02-21 15:45:51.253702"], ["password_digest", "[FILTERED]"]]

  def edit
    if params[:id] == session[:user_id]
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if params[:id] == session[:user_id]
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]